In [1]:
import pandas as pd

@Q1>
s = [4, 8, 15, 16, 23, 42]

In [4]:
s1 = pd.Series([4, 8, 15, 16, 23, 42])

In [5]:
s1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2>

In [6]:
l = [1,2,3,4,5,6,7,8,9,10]
s2 = pd.Series(l)
s2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3>

In [7]:
d = {'Name': ['Alice', 'Bob', 'Clair'],
    'Áge': [25,30,37],
    'Gender': ['Female', 'Male', 'Femal']}

In [8]:
df = pd.DataFrame(d)

In [10]:
df

    Name  Áge  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   37   Femal

Q4> A series is one dimentional array that can hold any data type of (integer, string, float etc0
 In datafram two dimentional array that is similar to table or spreadsheet

In [13]:
s4 = pd.Series([4, 8, 15, 16, 23, 42])

In [15]:
type(s4)

pandas.core.series.Series

In [16]:
df = pd.DataFrame(d)

In [17]:
df

    Name  Áge  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   37   Femal

Q5>common function in datafram that use for manipulate the data
ex: set_index, reset_index, reindex, groupby, iloc, loc, drop, fillna, read_csv, xlsx, html etc

In [37]:
d1 = {'a': [8,7,6,1],
     'b': [2,44,66,8],
     'c': ['r', 's', 't', 'u'],
     'd': [0,1,0,1]}

In [38]:
df3 = pd.DataFrame(d1)

In [40]:
df3.groupby(['d']).mean()

/tmp/ipykernel_91/3212880176.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df3.groupby(['d']).mean()

     a     b
d
0  7.0  34.0
1  4.0  26.0

Q6>
series and dataframe in pandas is mutable while panel is not. bacause in pandas and dataframe we use to add, remove and delete the data while not in pandel

Q>7

In [41]:
name_series = pd.Series(['harry', 'ramson', 'harvard'])
age_series = pd.Series([21,31,22])
college_series = pd.Series(['colombia', 'havard','manchester'])

In [42]:
df7 = pd.DataFrame({'Name': name_series,
                   'Age': age_series,
                   'college': college_series})

In [43]:
df7

      Name  Age     college
0    harry   21    colombia
1   ramson   31      havard
2  harvard   22  manchester